0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    east
    {
        type            pressureInletOutletVelocity;
		value uniform (0 0 0);
    }
    north
    {
        type            pressureInletOutletVelocity;
		value uniform (0 0 0);
    }
    south
    {
        type            pressureInletOutletVelocity;
		value uniform (0 0 0);
    }
    west
    {
        type            logProfileVelocityInlet;
        UfreeStream     10;
        uDirection      (1.0000 0.0000 0.0000);
        inputWindHeight_Veg 10;
        z0              0.01;
        Rd              0;
        firstCellHeight 5.51;
        value           uniform (10.0 0.0 0.0);
    }
  
    minZ
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    maxZ
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
