0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    north //maxY
    {
        type         calculated;//   symmetryPlane;
        value uniform 0;
    }
    west
    {
        type            calculated;
        value           uniform 0;
    }
    east //maxX
    {
        type            calculated;
        value           uniform 0;
    }
    south //minY
    {
        //type            symmetryPlane;
        type            calculated;
        value           uniform 0;
    }
    minZ
    {
        type            nutNonEquiWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.1;
    }
    maxZ
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
