system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices
(
    (-97.875  -131.875  13.248849999999999)
    (191.875  -131.875  13.248849999999999)
    (191.875  117.875  13.248849999999999)
    (-97.875  117.875  13.248849999999999)
    (-97.875  -131.875  40.822600000000001)
    (191.875  -131.875  40.822600000000001)
    (191.875  117.875  40.822600000000001)
    (-97.875  117.875  40.822600000000001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (53 46 5) simpleGrading (1.0 1.0 1)
);

edges
(
);

boundary
(
    north
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    west
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    east
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    south
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    minZ
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    maxZ
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //

